<a href="https://colab.research.google.com/github/AugustoSavi/Python-para-Ciencia-de-Dados-Formacao-Basica/blob/master/Dados_categ%C3%B3ricos_e_o_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

caminho = 'https://gist.githubusercontent.com/seankross/a412dfbd88b3db70b74b/raw/5f23f993cd87c283ce766e7ac6b329ee7cc2e1d1/mtcars.csv'
carros = pd.read_csv(caminho)
carros.columns = ['nomes','mpg', 'cyl',	'disp',	'hp',	'drat','wt','qsec',	'vs','am','qtd_marchas','carb']
carros.index = carros.nomes

carros.head()

                               nomes   mpg  cyl  ...  am  qtd_marchas  carb
nomes                                            ...
Mazda RX4                  Mazda RX4  21.0    6  ...   1            4     4
Mazda RX4 Wag          Mazda RX4 Wag  21.0    6  ...   1            4     4
Datsun 710                Datsun 710  22.8    4  ...   1            4     1
Hornet 4 Drive        Hornet 4 Drive  21.4    6  ...   0            3     1
Hornet Sportabout  Hornet Sportabout  18.7    8  ...   0            3     2

[5 rows x 12 columns]

In [0]:
carros_cat = carros[['cyl','am','qtd_marchas','carb']]

In [5]:
marchas_grupos = carros_cat.groupby('qtd_marchas')
marchas_grupos.describe().T

qtd_marchas          3          4         5
cyl  count   15.000000  12.000000  5.000000
     mean     7.466667   4.666667  6.000000
     std      1.187234   0.984732  2.000000
     min      4.000000   4.000000  4.000000
     25%      8.000000   4.000000  4.000000
     50%      8.000000   4.000000  6.000000
     75%      8.000000   6.000000  8.000000
     max      8.000000   6.000000  8.000000
am   count   15.000000  12.000000  5.000000
     mean     0.000000   0.666667  1.000000
     std      0.000000   0.492366  0.000000
     min      0.000000   0.000000  1.000000
     25%      0.000000   0.000000  1.000000
     50%      0.000000   1.000000  1.000000
     75%      0.000000   1.000000  1.000000
     max      0.000000   1.000000  1.000000
carb count   15.000000  12.000000  5.000000
     mean     2.666667   2.333333  4.400000
     std      1.175139   1.302678  2.607681
     min      1.000000   1.000000  2.000000
     25%      2.000000   1.000000  2.000000
     50%      3.000000   2.000000  4.000000
     75%      4.000000   4.000000  6.000000
     max      4.000000   4.000000  8.000000

In [0]:
carros['group']=pd.Series(carros['qtd_marchas'],dtype='category')

In [7]:
carros.dtypes

nomes            object
mpg             float64
cyl               int64
disp            float64
hp                int64
drat            float64
wt              float64
qsec            float64
vs                int64
am                int64
qtd_marchas       int64
carb              int64
group          category
dtype: object

In [8]:
carros['group'].head()

nomes
Mazda RX4            4
Mazda RX4 Wag        4
Datsun 710           4
Hornet 4 Drive       3
Hornet Sportabout    3
Name: group, dtype: category
Categories (3, int64): [3, 4, 5]

In [9]:
pd.crosstab(carros['am'],carros['qtd_marchas'])

qtd_marchas   3  4  5
am
0            15  4  0
1             0  8  5